#include<stdio.h> 
int main(){
	int m,n;
	scanf("%d%d",&m,&n);
	int a[m][n];
	//输入矩阵 
	for(int i=0;i<m;i++){
		for(int j=0;j<n;j++){
			scanf("%d",&a[i][j]);
		}
	}
	int sum=m*n;//矩阵中数的总数 
	int i,j;
	i=-1;
	j=0;
	while(sum){
	    //首先向下走：列数不变，行数+1
	    //终止条件：无路可走或已经取过 
	    while(a[++i][j]!=-1 && i<m){
	        printf("%d ",a[i][j]);//输出取到的数 
	        a[i][j]=-1;//取过后将该位置值置为-1
	        sum--;//每取出一个数，总数减1 
	    }
	    i--;//回到当前行,因为前面的++i，让i大了一个 
	    
		//向下走不通了左转就向右走：行数不变，列数+1 
		while(a[i][++j]!=-1 && j<n){
	        printf("%d ",a[i][j]);
	        a[i][j]=-1;
	        sum--; 
	    }
	    j--;//回到当前列,因为前面的++j，让j大了一个 
	    
		//向右走不通了左转就向上走 ： 列数不变，行数-1
	    //终止条件：无路可走或已经取过
		while(a[--i][j]!=-1 && i>=0){  
	        printf("%d ",a[i][j]);//输出取到的数
	        a[i][j]=-1;//取过后将该位置值置为-1 
	        sum--;//每取出一个数，总数减1 
	    }  
	    i++;//回到当前行,因为前面的--i，让i小了一个
	    
		//向上走不通了左转就向左走：行数不变，列数-1
	    while(a[i][--j]!=-1 && j>=0){  
	        printf("%d ",a[i][j]);
	        a[i][j]=-1;  
	        sum--;  
	    }  
	    j++;//回到当前列,因为前面的--j，让j小了一个
	}
}
